
ПодключитьСценарий(".\src\LeadParser\Ext\ObjectModule.bsl", "Парсер");

ЧтениеXML = New ЧтениеXML;
ЧтениеXML.ОткрытьФайл("C:\temp\ERP\Configuration.xml");
ЧтениеXML.Прочитать(); // MetaDataObject
ЧтениеXML.Прочитать();

Парсер = Новый Парсер;
Виды = Парсер.Виды();
Результат = Парсер.Разобрать(ЧтениеXML, Виды, Виды.Configuration);

Сообщить(Результат.Properties);

ЗаписьJSON = Новый ЗаписьJSON;
ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".json");
ЗаписьJSON.ОткрытьФайл(ИмяВременногоФайла,,, Новый ПараметрыЗаписиJSON(, Символы.Таб));
ЗаписатьJSON(ЗаписьJSON, Результат);
ЗаписьJSON.Закрыть();

ЧтениеТекста = Новый ЧтениеТекста(ИмяВременногоФайла);
Сообщить(ЧтениеТекста.Прочитать());

